In [6]:
from pandas import Series, DataFrame
obj = Series([100, 200, 300, 400, 500], index=['d', 'a', 'b', 'e', 'c'])
obj

d    100
a    200
b    300
e    400
c    500
dtype: int64

In [3]:
obj = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj

a    200
b    300
c    500
d    100
e    400
dtype: int64

In [8]:
data = {'Name': ['John', 'Tim', 'Rob'], 
        'Age': [34, 23, 22],
        'Salary': [4500, 2300, 5800]}
frame = DataFrame(data)
frame

   Name  Age  Salary
0  John   34    4500
1   Tim   23    2300
2   Rob   22    5800

In [9]:
frame = frame.reindex([0, 2, 1])
frame

   Name  Age  Salary
0  John   34    4500
2   Rob   22    5800
1   Tim   23    2300

In [10]:
fields = ['Name', 'Age', 'Salary']
frame = frame.reindex(columns=fields)
frame

   Name  Age  Salary
0  John   34    4500
2   Rob   22    5800
1   Tim   23    2300

In [12]:
frame2 = frame.drop([2, 0])
frame2

  Name  Age  Salary
1  Tim   23    2300

In [14]:
frame3 = frame.drop('Salary', axis=1)
frame3

   Name  Age
0  John   34
2   Rob   22
1   Tim   23